terraform plan:

```
# aws_route53_zone.customer_deploy_parent_zone will be created
+ resource "aws_route53_zone" "customer_deploy_parent_zone" {
    + comment       = "Managed by Terraform"
    + force_destroy = false
    + id            = (known after apply)
    + name          = "cdp.sweetops.net"
    + name_servers  = (known after apply)
    + tags          = {
        + "Attributes" = "deploy"
        + "Name"       = "so-ci-customer-deploy"
        + "Namespace"  = "so"
        + "Stage"      = "ci"
      }
    + vpc_id        = (known after apply)
    + vpc_region    = (known after apply)
    + zone_id       = (known after apply)
  }

# module.customer_deploy_aws_domain.data.aws_route53_zone.parent_zone[0] will be read during apply
# (config refers to values not yet known)
<= data "aws_route53_zone" "parent_zone"  {
    + caller_reference           = (known after apply)
    + comment                    = (known after apply)
    + id                         = (known after apply)
    + linked_service_description = (known after apply)
    + linked_service_principal   = (known after apply)
    + name_servers               = (known after apply)
    + resource_record_set_count  = (known after apply)
    + tags                       = (known after apply)
    + vpc_id                     = (known after apply)
    + zone_id                    = (known after apply)
  }

# module.customer_deploy_aws_domain.aws_route53_record.ns[0] will be created
+ resource "aws_route53_record" "ns" {
    + allow_overwrite = (known after apply)
    + fqdn            = (known after apply)
    + id              = (known after apply)
    + name            = "aws.cdp.sweetops.net"
    + records         = (known after apply)
    + ttl             = 60
    + type            = "NS"
    + zone_id         = (known after apply)
  }

# module.customer_deploy_aws_domain.aws_route53_record.soa[0] will be created
+ resource "aws_route53_record" "soa" {
    + allow_overwrite = true
    + fqdn            = (known after apply)
    + id              = (known after apply)
    + name            = "aws.cdp.sweetops.net"
    + records         = (known after apply)
    + ttl             = 30
    + type            = "SOA"
    + zone_id         = (known after apply)
  }

# module.customer_deploy_aws_domain.aws_route53_zone.default[0] will be created
+ resource "aws_route53_zone" "default" {
    + comment       = "Managed by Terraform"
    + force_destroy = false
    + id            = (known after apply)
    + name          = "aws.cdp.sweetops.net"
    + name_servers  = (known after apply)
    + tags          = {
        + "Attributes" = "deploy"
        + "Name"       = "so-ci-customer-deploy"
        + "Namespace"  = "so"
        + "Stage"      = "ci"
      }
    + vpc_id        = (known after apply)
    + vpc_region    = (known after apply)
    + zone_id       = (known after apply)
  }

```
terraform apply:

```
Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
Releasing state lock. This may take a few moments...
```